В двумерном массиве показать позиции числа, заданного пользователем или указать, что такого элемента нет
Дан целочисленный массив. Найти среднее арифметическое каждого из столбцов.
Написать программу, которая обменивает элементы первой строки и последней строки
Написать программу, упорядочивания по убыванию элементы каждой строки двумерной массива.
Написать программу, которая в двумерном массиве заменяет строки на столбцы или сообщить, что это невозможно (в случае, если матрица не квадратная).
В прямоугольной матрице найти строку с наименьшей суммой элементов.

// В двумерном массиве показать позиции числа, заданного пользователем или указать, что такого элемента нет

Console.Clear();
int x = int.Parse(Console.ReadLine() ?? "0");
int[,] matr = new int[5, 5];
for (int i = 0; i < matr.GetLength(0); i++)
{
    for (int j = 0; j < matr.GetLength(1); j++)
    {
        matr[i, j] = new Random().Next(1, 10);
        Console.Write($" {matr[i, j]} ");
    }
    Console.WriteLine();
}
Console.WriteLine();
for (int i = 0; i < matr.GetLength(0); i++)
{
    for (int j = 0; j < matr.GetLength(1); j++)
    {
        if (matr[i, j] == x)
        {
            int index1 = i;
            int index2 = j;
            Console.Write($"Позиция: {index1},{index2} ");
            return;
        }
   }

}
Console.WriteLine($"Такого элемента нет");

